app/app/controllers/pages_controller.rb

  def index
    user = User.all.sample

    render json: {
      app_name: ENV["APP"],
      view_count: Count.last&.view_count,
      user: user.slice(:name, :address)
---
SELECT `users`.* FROM `users`
SELECT `counts`.* FROM `counts` ORDER BY `counts`.`id` DESC LIMIT 1